RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/include/ip/cyip_smif_v3.h
/***************************************************************************//**
* \file cyip_smif_v3.h
*
* \brief
* SMIF IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2021), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_SMIF_V3_H_
#define _CYIP_SMIF_V3_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                     SMIF
*******************************************************************************/

#define SMIF_SMIF_CRYPTO_SECTION_SIZE           0x00000080UL
#define SMIF_DEVICE_SECTION_SIZE                0x00000080UL
#define SMIF_MPC_SECTION_SIZE                   0x00001000UL
#define SMIF_SECTION_SIZE                       0x00010000UL

/**
  * \brief Cryptography registers (one set for each key) (SMIF_SMIF_CRYPTO)
  */
typedef struct {
  __IOM uint32_t CRYPTO_CMD;                    /*!< 0x00000000 Cryptography command */
  __IOM uint32_t CRYPTO_ADDR;                   /*!< 0x00000004 Cryptography base address */
  __IOM uint32_t CRYPTO_MASK;                   /*!< 0x00000008 Cryptography mask */
  __IOM uint32_t CRYPTO_SUBREGION;              /*!< 0x0000000C Cryptography subregion disable */
   __IM uint32_t RESERVED[4];
  __IOM uint32_t CRYPTO_INPUT0;                 /*!< 0x00000020 Cryptography input 0 */
  __IOM uint32_t CRYPTO_INPUT1;                 /*!< 0x00000024 Cryptography input 1 */
  __IOM uint32_t CRYPTO_INPUT2;                 /*!< 0x00000028 Cryptography input 2 */
  __IOM uint32_t CRYPTO_INPUT3;                 /*!< 0x0000002C Cryptography input 3 */
   __IM uint32_t RESERVED1[4];
   __OM uint32_t CRYPTO_KEY0;                   /*!< 0x00000040 Cryptography key 0 */
   __OM uint32_t CRYPTO_KEY1;                   /*!< 0x00000044 Cryptography key 1 */
   __OM uint32_t CRYPTO_KEY2;                   /*!< 0x00000048 Cryptography key 2 */
   __OM uint32_t CRYPTO_KEY3;                   /*!< 0x0000004C Cryptography key 3 */
   __IM uint32_t RESERVED2[4];
  __IOM uint32_t CRYPTO_OUTPUT0;                /*!< 0x00000060 Cryptography output 0 */
  __IOM uint32_t CRYPTO_OUTPUT1;                /*!< 0x00000064 Cryptography output 1 */
  __IOM uint32_t CRYPTO_OUTPUT2;                /*!< 0x00000068 Cryptography output 2 */
  __IOM uint32_t CRYPTO_OUTPUT3;                /*!< 0x0000006C Cryptography output 3 */
   __IM uint32_t RESERVED3[4];
} SMIF_SMIF_CRYPTO_Type;                        /*!< Size = 128 (0x80) */

/**
  * \brief Device (only used for XIP acceses) (SMIF_DEVICE)
  */
typedef struct {
  __IOM uint32_t CTL;                           /*!< 0x00000000 Control */
   __IM uint32_t RESERVED;
  __IOM uint32_t ADDR;                          /*!< 0x00000008 Device region base address */
  __IOM uint32_t MASK;                          /*!< 0x0000000C Device region mask */
   __IM uint32_t RESERVED1[4];
  __IOM uint32_t ADDR_CTL;                      /*!< 0x00000020 Address control */
   __IM uint32_t RESERVED2[2];
  __IOM uint32_t DELAY_TAP_SEL;                 /*!< 0x0000002C RX Clock Delay Tap Select Register */
   __IM uint32_t RD_STATUS;                     /*!< 0x00000030 Read status */
   __IM uint32_t RESERVED3[3];
  __IOM uint32_t RD_CMD_CTL;                    /*!< 0x00000040 Read command control */
  __IOM uint32_t RD_ADDR_CTL;                   /*!< 0x00000044 Read address control */
  __IOM uint32_t RD_MODE_CTL;                   /*!< 0x00000048 Read mode control */
  __IOM uint32_t RD_DUMMY_CTL;                  /*!< 0x0000004C Read dummy control */
  __IOM uint32_t RD_DATA_CTL;                   /*!< 0x00000050 Read data control */
  __IOM uint32_t RD_CRC_CTL;                    /*!< 0x00000054 Read Bus CRC control */
  __IOM uint32_t RD_BOUND_CTL;                  /*!< 0x00000058 Read boundary control */
   __IM uint32_t RESERVED4;
  __IOM uint32_t WR_CMD_CTL;                    /*!< 0x00000060 Write command control */
  __IOM uint32_t WR_ADDR_CTL;                   /*!< 0x00000064 Write address control */
  __IOM uint32_t WR_MODE_CTL;                   /*!< 0x00000068 Write mode control */
  __IOM uint32_t WR_DUMMY_CTL;                  /*!< 0x0000006C Write dummy control */
  __IOM uint32_t WR_DATA_CTL;                   /*!< 0x00000070 Write data control */
  __IOM uint32_t WR_CRC_CTL;                    /*!< 0x00000074 Write Bus CRC control */
   __IM uint32_t RESERVED5[2];
} SMIF_DEVICE_Type;                             /*!< Size = 128 (0x80) */

/**
  * \brief MPC Memory Protection Controller registers (SMIF_MPC)
  */
typedef struct {
  __IOM uint32_t CFG;                           /*!< 0x00000000 Config register with error response, RegionID PPC_MPC_MAIN is
                                                                the security owner PC. The error response configuration is
                                                                located in CFG.RESPONSE, only one such configuration exists
                                                                applying to all protection contexts in the system. */
   __IM uint32_t RESERVED[3];
  __IOM uint32_t INTR;                          /*!< 0x00000010 Interrupt */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000014 Interrupt set */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000018 Interrupt mask */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000001C Interrupt masked */
   __IM uint32_t INTR_INFO1;                    /*!< 0x00000020 Infor about violation */
   __IM uint32_t INTR_INFO2;                    /*!< 0x00000024 Infor about violation */
   __IM uint32_t RESERVED1[54];
  __IOM uint32_t CTRL;                          /*!< 0x00000100 Control register with lock bit and auto-increment only
                                                                (Separate CTRL for each PC depends on access_pc) */
   __IM uint32_t BLK_MAX;                       /*!< 0x00000104 Max value of block-based index register */
   __IM uint32_t BLK_CFG;                       /*!< 0x00000108 Block size & initialization in progress */
  __IOM uint32_t BLK_IDX;                       /*!< 0x0000010C Index of 32-block group accessed through BLK_LUT (Separate IDX
                                                                for each PC depending on access_pc) */
  __IOM uint32_t BLK_LUT;                       /*!< 0x00000110 NS status for 32 blocks at BLK_IDX with PC=<access_pc> */
   __IM uint32_t RESERVED2[59];
  __IOM uint32_t ROT_CTRL;                      /*!< 0x00000200 Control register with lock bit and auto-increment only */
  __IOM uint32_t ROT_CFG;                       /*!< 0x00000204 Sets block-size to match memory size (external memory only) */
   __IM uint32_t ROT_BLK_MAX;                   /*!< 0x00000208 Max value of block-based index register for ROT */
   __IM uint32_t ROT_BLK_CFG;                   /*!< 0x0000020C Same as BLK_CFG */
  __IOM uint32_t ROT_BLK_IDX;                   /*!< 0x00000210 Index of 8-block group accessed through ROT_BLK_LUT_* */
  __IOM uint32_t ROT_BLK_PC;                    /*!< 0x00000214 Protection context of 8-block group accesses through
                                                                ROT_BLK_LUT */
  __IOM uint32_t ROT_BLK_LUT;                   /*!< 0x00000218 (R,W,NS) bits for 8 blocks at ROT_BLK_IDX for PC=ROT_BKL_PC */
   __IM uint32_t RESERVED3[889];
} SMIF_MPC_Type;                                /*!< Size = 4096 (0x1000) */

/**
  * \brief Serial Memory Interface (SMIF)
  */
typedef struct {
  __IOM uint32_t CTL;                           /*!< 0x00000000 Control */
   __IM uint32_t STATUS;                        /*!< 0x00000004 Status */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t INT_CLOCK_DELAY_TAP_SEL0;      /*!< 0x00000010 Internal Clocking Delay Tap Select Register 0 */
  __IOM uint32_t INT_CLOCK_DELAY_TAP_SEL1;      /*!< 0x00000014 Internal Clocking Delay Tap Select Register 1 */
  __IOM uint32_t DL_CTL;                        /*!< 0x00000018 Data Learning Control Register */
   __IM uint32_t RESERVED1;
   __IM uint32_t DL_STATUS0;                    /*!< 0x00000020 Data Learning Status Register 0 */
   __IM uint32_t DL_STATUS1;                    /*!< 0x00000024 Data Learning Status Register 1 */
   __IM uint32_t RESERVED2[7];
   __IM uint32_t TX_CMD_FIFO_STATUS;            /*!< 0x00000044 Transmitter command FIFO status */
   __IM uint32_t TX_CMD_MMIO_FIFO_STATUS;       /*!< 0x00000048 Transmitter command MMIO FIFO status */
   __IM uint32_t RESERVED3;
   __OM uint32_t TX_CMD_MMIO_FIFO_WR;           /*!< 0x00000050 Transmitter command MMIO FIFO write */
   __IM uint32_t RESERVED4[11];
  __IOM uint32_t TX_DATA_MMIO_FIFO_CTL;         /*!< 0x00000080 Transmitter data MMIO FIFO control */
   __IM uint32_t TX_DATA_FIFO_STATUS;           /*!< 0x00000084 Transmitter data FIFO status */
   __IM uint32_t TX_DATA_MMIO_FIFO_STATUS;      /*!< 0x00000088 Transmitter data MMIO FIFO status */
   __IM uint32_t RESERVED5;
   __OM uint32_t TX_DATA_MMIO_FIFO_WR1;         /*!< 0x00000090 Transmitter data MMIO FIFO write */
   __OM uint32_t TX_DATA_MMIO_FIFO_WR2;         /*!< 0x00000094 Transmitter data MMIO FIFO write */
   __OM uint32_t TX_DATA_MMIO_FIFO_WR4;         /*!< 0x00000098 Transmitter data MMIO FIFO write */
   __OM uint32_t TX_DATA_MMIO_FIFO_WR1ODD;      /*!< 0x0000009C Transmitter data MMIO FIFO write */
   __IM uint32_t RESERVED6[8];
  __IOM uint32_t RX_DATA_MMIO_FIFO_CTL;         /*!< 0x000000C0 Receiver data MMIO FIFO control */
   __IM uint32_t RX_DATA_MMIO_FIFO_STATUS;      /*!< 0x000000C4 Receiver data MMIO FIFO status */
   __IM uint32_t RX_DATA_FIFO_STATUS;           /*!< 0x000000C8 Receiver data FIFO status */
   __IM uint32_t RESERVED7;
   __IM uint32_t RX_DATA_MMIO_FIFO_RD1;         /*!< 0x000000D0 Receiver data MMIO FIFO read */
   __IM uint32_t RX_DATA_MMIO_FIFO_RD2;         /*!< 0x000000D4 Receiver data MMIO FIFO read */
   __IM uint32_t RX_DATA_MMIO_FIFO_RD4;         /*!< 0x000000D8 Receiver data MMIO FIFO read */
   __IM uint32_t RESERVED8;
   __IM uint32_t RX_DATA_MMIO_FIFO_RD1_SILENT;  /*!< 0x000000E0 Receiver data MMIO FIFO silent read */
   __IM uint32_t RESERVED9[7];
  __IOM uint32_t SLOW_CA_CTL;                   /*!< 0x00000100 Slow cache control */
   __IM uint32_t RESERVED10;
  __IOM uint32_t SLOW_CA_CMD;                   /*!< 0x00000108 Slow cache command */
   __IM uint32_t RESERVED11[29];
  __IOM uint32_t FAST_CA_CTL;                   /*!< 0x00000180 Fast cache control */
   __IM uint32_t RESERVED12;
  __IOM uint32_t FAST_CA_CMD;                   /*!< 0x00000188 Fast cache command */
   __IM uint32_t RESERVED13[29];
        SMIF_SMIF_CRYPTO_Type SMIF_CRYPTO_BLOCK[8]; /*!< 0x00000200 Cryptography registers (one set for each key) */
  __IOM uint32_t CRC_CMD;                       /*!< 0x00000600 CRC Command */
   __IM uint32_t RESERVED14[7];
  __IOM uint32_t CRC_INPUT0;                    /*!< 0x00000620 CRC input 0 */
  __IOM uint32_t CRC_INPUT1;                    /*!< 0x00000624 CRC input 1 */
   __IM uint32_t RESERVED15[6];
   __IM uint32_t CRC_OUTPUT;                    /*!< 0x00000640 CRC output */
   __IM uint32_t RESERVED16[95];
  __IOM uint32_t INTR;                          /*!< 0x000007C0 Interrupt register */
  __IOM uint32_t INTR_SET;                      /*!< 0x000007C4 Interrupt set register */
  __IOM uint32_t INTR_MASK;                     /*!< 0x000007C8 Interrupt mask register */
   __IM uint32_t INTR_MASKED;                   /*!< 0x000007CC Interrupt masked register */
   __IM uint32_t INTR_CAUSE;                    /*!< 0x000007D0 Distinguishes normal vs. MPC interrupt */
   __IM uint32_t RESERVED17[11];
        SMIF_DEVICE_Type DEVICE[4];             /*!< 0x00000800 Device (only used for XIP acceses) */
   __IM uint32_t RESERVED18[384];
        SMIF_MPC_Type MPC[1];                   /*!< 0x00001000 MPC Memory Protection Controller registers */
} SMIF_Type;                                    /*!< Size = 8192 (0x2000) */


/* SMIF_SMIF_CRYPTO.CRYPTO_CMD */
#define SMIF_SMIF_CRYPTO_CRYPTO_CMD_START_Pos   0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_CMD_START_Msk   0x1UL
/* SMIF_SMIF_CRYPTO.CRYPTO_ADDR */
#define SMIF_SMIF_CRYPTO_CRYPTO_ADDR_ADDR_Pos   8UL
#define SMIF_SMIF_CRYPTO_CRYPTO_ADDR_ADDR_Msk   0xFFFFFF00UL
/* SMIF_SMIF_CRYPTO.CRYPTO_MASK */
#define SMIF_SMIF_CRYPTO_CRYPTO_MASK_MASK_Pos   8UL
#define SMIF_SMIF_CRYPTO_CRYPTO_MASK_MASK_Msk   0xFFFFFF00UL
/* SMIF_SMIF_CRYPTO.CRYPTO_SUBREGION */
#define SMIF_SMIF_CRYPTO_CRYPTO_SUBREGION_SUBREGION_DISABLE_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_SUBREGION_SUBREGION_DISABLE_Msk 0xFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_INPUT0 */
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_LSB_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_LSB_Msk 0xFUL
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_MSB_Pos 4UL
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_MSB_Msk 0xFFFFFFF0UL
/* SMIF_SMIF_CRYPTO.CRYPTO_INPUT1 */
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT1_INPUT_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT1_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_INPUT2 */
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT2_INPUT_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT2_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_INPUT3 */
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT3_INPUT_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_INPUT3_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_KEY0 */
#define SMIF_SMIF_CRYPTO_CRYPTO_KEY0_KEY_Pos    0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_KEY0_KEY_Msk    0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_KEY1 */
#define SMIF_SMIF_CRYPTO_CRYPTO_KEY1_KEY_Pos    0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_KEY1_KEY_Msk    0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_KEY2 */
#define SMIF_SMIF_CRYPTO_CRYPTO_KEY2_KEY_Pos    0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_KEY2_KEY_Msk    0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_KEY3 */
#define SMIF_SMIF_CRYPTO_CRYPTO_KEY3_KEY_Pos    0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_KEY3_KEY_Msk    0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_OUTPUT0 */
#define SMIF_SMIF_CRYPTO_CRYPTO_OUTPUT0_OUTPUT_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_OUTPUT0_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_OUTPUT1 */
#define SMIF_SMIF_CRYPTO_CRYPTO_OUTPUT1_OUTPUT_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_OUTPUT1_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_OUTPUT2 */
#define SMIF_SMIF_CRYPTO_CRYPTO_OUTPUT2_OUTPUT_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_OUTPUT2_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_SMIF_CRYPTO.CRYPTO_OUTPUT3 */
#define SMIF_SMIF_CRYPTO_CRYPTO_OUTPUT3_OUTPUT_Pos 0UL
#define SMIF_SMIF_CRYPTO_CRYPTO_OUTPUT3_OUTPUT_Msk 0xFFFFFFFFUL


/* SMIF_DEVICE.CTL */
#define SMIF_DEVICE_CTL_WR_EN_Pos               0UL
#define SMIF_DEVICE_CTL_WR_EN_Msk               0x1UL
#define SMIF_DEVICE_CTL_CRYPTO_EN_Pos           4UL
#define SMIF_DEVICE_CTL_CRYPTO_EN_Msk           0x10UL
#define SMIF_DEVICE_CTL_DATA_SEL_Pos            8UL
#define SMIF_DEVICE_CTL_DATA_SEL_Msk            0x300UL
#define SMIF_DEVICE_CTL_MERGE_TIMEOUT_Pos       12UL
#define SMIF_DEVICE_CTL_MERGE_TIMEOUT_Msk       0x7000UL
#define SMIF_DEVICE_CTL_MERGE_EN_Pos            15UL
#define SMIF_DEVICE_CTL_MERGE_EN_Msk            0x8000UL
#define SMIF_DEVICE_CTL_TOTAL_TIMEOUT_Pos       16UL
#define SMIF_DEVICE_CTL_TOTAL_TIMEOUT_Msk       0x3FFF0000UL
#define SMIF_DEVICE_CTL_TOTAL_TIMEOUT_EN_Pos    30UL
#define SMIF_DEVICE_CTL_TOTAL_TIMEOUT_EN_Msk    0x40000000UL
#define SMIF_DEVICE_CTL_ENABLED_Pos             31UL
#define SMIF_DEVICE_CTL_ENABLED_Msk             0x80000000UL
/* SMIF_DEVICE.ADDR */
#define SMIF_DEVICE_ADDR_ADDR_Pos               8UL
#define SMIF_DEVICE_ADDR_ADDR_Msk               0xFFFFFF00UL
/* SMIF_DEVICE.MASK */
#define SMIF_DEVICE_MASK_MASK_Pos               8UL
#define SMIF_DEVICE_MASK_MASK_Msk               0xFFFFFF00UL
/* SMIF_DEVICE.ADDR_CTL */
#define SMIF_DEVICE_ADDR_CTL_SIZE3_Pos          0UL
#define SMIF_DEVICE_ADDR_CTL_SIZE3_Msk          0x7UL
#define SMIF_DEVICE_ADDR_CTL_DIV2_Pos           8UL
#define SMIF_DEVICE_ADDR_CTL_DIV2_Msk           0x100UL
/* SMIF_DEVICE.DELAY_TAP_SEL */
#define SMIF_DEVICE_DELAY_TAP_SEL_SEL_Pos       0UL
#define SMIF_DEVICE_DELAY_TAP_SEL_SEL_Msk       0xFFUL
/* SMIF_DEVICE.RD_STATUS */
#define SMIF_DEVICE_RD_STATUS_FS_STATUS_Pos     0UL
#define SMIF_DEVICE_RD_STATUS_FS_STATUS_Msk     0xFFUL
/* SMIF_DEVICE.RD_CMD_CTL */
#define SMIF_DEVICE_RD_CMD_CTL_CODE_Pos         0UL
#define SMIF_DEVICE_RD_CMD_CTL_CODE_Msk         0xFFUL
#define SMIF_DEVICE_RD_CMD_CTL_CODEH_Pos        8UL
#define SMIF_DEVICE_RD_CMD_CTL_CODEH_Msk        0xFF00UL
#define SMIF_DEVICE_RD_CMD_CTL_WIDTH_Pos        16UL
#define SMIF_DEVICE_RD_CMD_CTL_WIDTH_Msk        0x30000UL
#define SMIF_DEVICE_RD_CMD_CTL_DDR_MODE_Pos     18UL
#define SMIF_DEVICE_RD_CMD_CTL_DDR_MODE_Msk     0x40000UL
#define SMIF_DEVICE_RD_CMD_CTL_PRESENT2_Pos     30UL
#define SMIF_DEVICE_RD_CMD_CTL_PRESENT2_Msk     0xC0000000UL
/* SMIF_DEVICE.RD_ADDR_CTL */
#define SMIF_DEVICE_RD_ADDR_CTL_WIDTH_Pos       16UL
#define SMIF_DEVICE_RD_ADDR_CTL_WIDTH_Msk       0x30000UL
#define SMIF_DEVICE_RD_ADDR_CTL_DDR_MODE_Pos    18UL
#define SMIF_DEVICE_RD_ADDR_CTL_DDR_MODE_Msk    0x40000UL
/* SMIF_DEVICE.RD_MODE_CTL */
#define SMIF_DEVICE_RD_MODE_CTL_CODE_Pos        0UL
#define SMIF_DEVICE_RD_MODE_CTL_CODE_Msk        0xFFUL
#define SMIF_DEVICE_RD_MODE_CTL_CODEH_Pos       8UL
#define SMIF_DEVICE_RD_MODE_CTL_CODEH_Msk       0xFF00UL
#define SMIF_DEVICE_RD_MODE_CTL_WIDTH_Pos       16UL
#define SMIF_DEVICE_RD_MODE_CTL_WIDTH_Msk       0x30000UL
#define SMIF_DEVICE_RD_MODE_CTL_DDR_MODE_Pos    18UL
#define SMIF_DEVICE_RD_MODE_CTL_DDR_MODE_Msk    0x40000UL
#define SMIF_DEVICE_RD_MODE_CTL_PRESENT2_Pos    30UL
#define SMIF_DEVICE_RD_MODE_CTL_PRESENT2_Msk    0xC0000000UL
/* SMIF_DEVICE.RD_DUMMY_CTL */
#define SMIF_DEVICE_RD_DUMMY_CTL_SIZE5_Pos      0UL
#define SMIF_DEVICE_RD_DUMMY_CTL_SIZE5_Msk      0x1FUL
#define SMIF_DEVICE_RD_DUMMY_CTL_PRESENT2_Pos   30UL
#define SMIF_DEVICE_RD_DUMMY_CTL_PRESENT2_Msk   0xC0000000UL
/* SMIF_DEVICE.RD_DATA_CTL */
#define SMIF_DEVICE_RD_DATA_CTL_WIDTH_Pos       16UL
#define SMIF_DEVICE_RD_DATA_CTL_WIDTH_Msk       0x30000UL
#define SMIF_DEVICE_RD_DATA_CTL_DDR_MODE_Pos    18UL
#define SMIF_DEVICE_RD_DATA_CTL_DDR_MODE_Msk    0x40000UL
/* SMIF_DEVICE.RD_CRC_CTL */
#define SMIF_DEVICE_RD_CRC_CTL_STATUS_CHECK_MASK_Pos 0UL
#define SMIF_DEVICE_RD_CRC_CTL_STATUS_CHECK_MASK_Msk 0xFFUL
#define SMIF_DEVICE_RD_CRC_CTL_STATUS_ERROR_POL_Pos 8UL
#define SMIF_DEVICE_RD_CRC_CTL_STATUS_ERROR_POL_Msk 0xFF00UL
#define SMIF_DEVICE_RD_CRC_CTL_DATA_CRC_INPUT_SIZE_Pos 16UL
#define SMIF_DEVICE_RD_CRC_CTL_DATA_CRC_INPUT_SIZE_Msk 0xFF0000UL
#define SMIF_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_WIDTH_Pos 24UL
#define SMIF_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_WIDTH_Msk 0x3000000UL
#define SMIF_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_DDR_MODE_Pos 26UL
#define SMIF_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_DDR_MODE_Msk 0x4000000UL
#define SMIF_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_INPUT_Pos 27UL
#define SMIF_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_INPUT_Msk 0x8000000UL
#define SMIF_DEVICE_RD_CRC_CTL_DATA_CRC_CHECK_Pos 28UL
#define SMIF_DEVICE_RD_CRC_CTL_DATA_CRC_CHECK_Msk 0x10000000UL
#define SMIF_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_PRESENT_Pos 30UL
#define SMIF_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_PRESENT_Msk 0x40000000UL
#define SMIF_DEVICE_RD_CRC_CTL_DATA_CRC_PRESENT_Pos 31UL
#define SMIF_DEVICE_RD_CRC_CTL_DATA_CRC_PRESENT_Msk 0x80000000UL
/* SMIF_DEVICE.RD_BOUND_CTL */
#define SMIF_DEVICE_RD_BOUND_CTL_SIZE5_Pos      0UL
#define SMIF_DEVICE_RD_BOUND_CTL_SIZE5_Msk      0x1FUL
#define SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE_Pos 16UL
#define SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE_Msk 0x30000UL
#define SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR_Pos 20UL
#define SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR_Msk 0x300000UL
#define SMIF_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN_Pos 28UL
#define SMIF_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN_Msk 0x10000000UL
#define SMIF_DEVICE_RD_BOUND_CTL_PRESENT_Pos    31UL
#define SMIF_DEVICE_RD_BOUND_CTL_PRESENT_Msk    0x80000000UL
/* SMIF_DEVICE.WR_CMD_CTL */
#define SMIF_DEVICE_WR_CMD_CTL_CODE_Pos         0UL
#define SMIF_DEVICE_WR_CMD_CTL_CODE_Msk         0xFFUL
#define SMIF_DEVICE_WR_CMD_CTL_CODEH_Pos        8UL
#define SMIF_DEVICE_WR_CMD_CTL_CODEH_Msk        0xFF00UL
#define SMIF_DEVICE_WR_CMD_CTL_WIDTH_Pos        16UL
#define SMIF_DEVICE_WR_CMD_CTL_WIDTH_Msk        0x30000UL
#define SMIF_DEVICE_WR_CMD_CTL_DDR_MODE_Pos     18UL
#define SMIF_DEVICE_WR_CMD_CTL_DDR_MODE_Msk     0x40000UL
#define SMIF_DEVICE_WR_CMD_CTL_PRESENT2_Pos     30UL
#define SMIF_DEVICE_WR_CMD_CTL_PRESENT2_Msk     0xC0000000UL
/* SMIF_DEVICE.WR_ADDR_CTL */
#define SMIF_DEVICE_WR_ADDR_CTL_WIDTH_Pos       16UL
#define SMIF_DEVICE_WR_ADDR_CTL_WIDTH_Msk       0x30000UL
#define SMIF_DEVICE_WR_ADDR_CTL_DDR_MODE_Pos    18UL
#define SMIF_DEVICE_WR_ADDR_CTL_DDR_MODE_Msk    0x40000UL
/* SMIF_DEVICE.WR_MODE_CTL */
#define SMIF_DEVICE_WR_MODE_CTL_CODE_Pos        0UL
#define SMIF_DEVICE_WR_MODE_CTL_CODE_Msk        0xFFUL
#define SMIF_DEVICE_WR_MODE_CTL_CODEH_Pos       8UL
#define SMIF_DEVICE_WR_MODE_CTL_CODEH_Msk       0xFF00UL
#define SMIF_DEVICE_WR_MODE_CTL_WIDTH_Pos       16UL
#define SMIF_DEVICE_WR_MODE_CTL_WIDTH_Msk       0x30000UL
#define SMIF_DEVICE_WR_MODE_CTL_DDR_MODE_Pos    18UL
#define SMIF_DEVICE_WR_MODE_CTL_DDR_MODE_Msk    0x40000UL
#define SMIF_DEVICE_WR_MODE_CTL_PRESENT2_Pos    30UL
#define SMIF_DEVICE_WR_MODE_CTL_PRESENT2_Msk    0xC0000000UL
/* SMIF_DEVICE.WR_DUMMY_CTL */
#define SMIF_DEVICE_WR_DUMMY_CTL_SIZE5_Pos      0UL
#define SMIF_DEVICE_WR_DUMMY_CTL_SIZE5_Msk      0x1FUL
#define SMIF_DEVICE_WR_DUMMY_CTL_RWDS_EN_Pos    17UL
#define SMIF_DEVICE_WR_DUMMY_CTL_RWDS_EN_Msk    0x20000UL
#define SMIF_DEVICE_WR_DUMMY_CTL_PRESENT2_Pos   30UL
#define SMIF_DEVICE_WR_DUMMY_CTL_PRESENT2_Msk   0xC0000000UL
/* SMIF_DEVICE.WR_DATA_CTL */
#define SMIF_DEVICE_WR_DATA_CTL_WIDTH_Pos       16UL
#define SMIF_DEVICE_WR_DATA_CTL_WIDTH_Msk       0x30000UL
#define SMIF_DEVICE_WR_DATA_CTL_DDR_MODE_Pos    18UL
#define SMIF_DEVICE_WR_DATA_CTL_DDR_MODE_Msk    0x40000UL
/* SMIF_DEVICE.WR_CRC_CTL */
#define SMIF_DEVICE_WR_CRC_CTL_DATA_CRC_INPUT_SIZE_Pos 16UL
#define SMIF_DEVICE_WR_CRC_CTL_DATA_CRC_INPUT_SIZE_Msk 0xFF0000UL
#define SMIF_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_WIDTH_Pos 24UL
#define SMIF_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_WIDTH_Msk 0x3000000UL
#define SMIF_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_DDR_MODE_Pos 26UL
#define SMIF_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_DDR_MODE_Msk 0x4000000UL
#define SMIF_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_INPUT_Pos 27UL
#define SMIF_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_INPUT_Msk 0x8000000UL
#define SMIF_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_PRESENT_Pos 30UL
#define SMIF_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_PRESENT_Msk 0x40000000UL
#define SMIF_DEVICE_WR_CRC_CTL_DATA_CRC_PRESENT_Pos 31UL
#define SMIF_DEVICE_WR_CRC_CTL_DATA_CRC_PRESENT_Msk 0x80000000UL


