RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/include/ip/cyip_smif_v3.h
/* SMIF_MPC.CFG */
#define SMIF_MPC_CFG_RESPONSE_Pos               4UL
#define SMIF_MPC_CFG_RESPONSE_Msk               0x10UL
/* SMIF_MPC.INTR */
#define SMIF_MPC_INTR_VIOLATION_Pos             0UL
#define SMIF_MPC_INTR_VIOLATION_Msk             0x1UL
/* SMIF_MPC.INTR_SET */
#define SMIF_MPC_INTR_SET_VIOLATION_Pos         0UL
#define SMIF_MPC_INTR_SET_VIOLATION_Msk         0x1UL
/* SMIF_MPC.INTR_MASK */
#define SMIF_MPC_INTR_MASK_VIOLATION_Pos        0UL
#define SMIF_MPC_INTR_MASK_VIOLATION_Msk        0x1UL
/* SMIF_MPC.INTR_MASKED */
#define SMIF_MPC_INTR_MASKED_VIOLATION_Pos      0UL
#define SMIF_MPC_INTR_MASKED_VIOLATION_Msk      0x1UL
/* SMIF_MPC.INTR_INFO1 */
#define SMIF_MPC_INTR_INFO1_VALUE_Pos           0UL
#define SMIF_MPC_INTR_INFO1_VALUE_Msk           0xFFFFFFFFUL
/* SMIF_MPC.INTR_INFO2 */
#define SMIF_MPC_INTR_INFO2_HMASTER_Pos         0UL
#define SMIF_MPC_INTR_INFO2_HMASTER_Msk         0xFFFFUL
#define SMIF_MPC_INTR_INFO2_HNONSEC_Pos         16UL
#define SMIF_MPC_INTR_INFO2_HNONSEC_Msk         0x10000UL
#define SMIF_MPC_INTR_INFO2_CFG_NS_Pos          17UL
#define SMIF_MPC_INTR_INFO2_CFG_NS_Msk          0x20000UL
#define SMIF_MPC_INTR_INFO2_HWRITE_Pos          18UL
#define SMIF_MPC_INTR_INFO2_HWRITE_Msk          0x40000UL
#define SMIF_MPC_INTR_INFO2_HAUSER_Pos          24UL
#define SMIF_MPC_INTR_INFO2_HAUSER_Msk          0xF000000UL
#define SMIF_MPC_INTR_INFO2_SECURITY_VIOLATION_Pos 30UL
#define SMIF_MPC_INTR_INFO2_SECURITY_VIOLATION_Msk 0x40000000UL
#define SMIF_MPC_INTR_INFO2_ACCESS_VIOLATION_Pos 31UL
#define SMIF_MPC_INTR_INFO2_ACCESS_VIOLATION_Msk 0x80000000UL
/* SMIF_MPC.CTRL */
#define SMIF_MPC_CTRL_AUTO_INC_Pos              8UL
#define SMIF_MPC_CTRL_AUTO_INC_Msk              0x100UL
#define SMIF_MPC_CTRL_LOCK_Pos                  31UL
#define SMIF_MPC_CTRL_LOCK_Msk                  0x80000000UL
/* SMIF_MPC.BLK_MAX */
#define SMIF_MPC_BLK_MAX_VALUE_Pos              0UL
#define SMIF_MPC_BLK_MAX_VALUE_Msk              0xFFFFFFFFUL
/* SMIF_MPC.BLK_CFG */
#define SMIF_MPC_BLK_CFG_BLOCK_SIZE_Pos         0UL
#define SMIF_MPC_BLK_CFG_BLOCK_SIZE_Msk         0xFUL
#define SMIF_MPC_BLK_CFG_INIT_IN_PROGRESS_Pos   31UL
#define SMIF_MPC_BLK_CFG_INIT_IN_PROGRESS_Msk   0x80000000UL
/* SMIF_MPC.BLK_IDX */
#define SMIF_MPC_BLK_IDX_VALUE_Pos              0UL
#define SMIF_MPC_BLK_IDX_VALUE_Msk              0xFFFFFFFFUL
/* SMIF_MPC.BLK_LUT */
#define SMIF_MPC_BLK_LUT_ATTR_NS0_Pos           0UL
#define SMIF_MPC_BLK_LUT_ATTR_NS0_Msk           0x1UL
#define SMIF_MPC_BLK_LUT_ATTR_NS1_Pos           1UL
#define SMIF_MPC_BLK_LUT_ATTR_NS1_Msk           0x2UL
#define SMIF_MPC_BLK_LUT_ATTR_NS2_Pos           2UL
#define SMIF_MPC_BLK_LUT_ATTR_NS2_Msk           0x4UL
#define SMIF_MPC_BLK_LUT_ATTR_NS3_Pos           3UL
#define SMIF_MPC_BLK_LUT_ATTR_NS3_Msk           0x8UL
#define SMIF_MPC_BLK_LUT_ATTR_NS4_Pos           4UL
#define SMIF_MPC_BLK_LUT_ATTR_NS4_Msk           0x10UL
#define SMIF_MPC_BLK_LUT_ATTR_NS5_Pos           5UL
#define SMIF_MPC_BLK_LUT_ATTR_NS5_Msk           0x20UL
#define SMIF_MPC_BLK_LUT_ATTR_NS6_Pos           6UL
#define SMIF_MPC_BLK_LUT_ATTR_NS6_Msk           0x40UL
#define SMIF_MPC_BLK_LUT_ATTR_NS7_Pos           7UL
#define SMIF_MPC_BLK_LUT_ATTR_NS7_Msk           0x80UL
#define SMIF_MPC_BLK_LUT_ATTR_NS8_Pos           8UL
#define SMIF_MPC_BLK_LUT_ATTR_NS8_Msk           0x100UL
#define SMIF_MPC_BLK_LUT_ATTR_NS9_Pos           9UL
#define SMIF_MPC_BLK_LUT_ATTR_NS9_Msk           0x200UL
#define SMIF_MPC_BLK_LUT_ATTR_NS10_Pos          10UL
#define SMIF_MPC_BLK_LUT_ATTR_NS10_Msk          0x400UL
#define SMIF_MPC_BLK_LUT_ATTR_NS11_Pos          11UL
#define SMIF_MPC_BLK_LUT_ATTR_NS11_Msk          0x800UL
#define SMIF_MPC_BLK_LUT_ATTR_NS12_Pos          12UL
#define SMIF_MPC_BLK_LUT_ATTR_NS12_Msk          0x1000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS13_Pos          13UL
#define SMIF_MPC_BLK_LUT_ATTR_NS13_Msk          0x2000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS14_Pos          14UL
#define SMIF_MPC_BLK_LUT_ATTR_NS14_Msk          0x4000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS15_Pos          15UL
#define SMIF_MPC_BLK_LUT_ATTR_NS15_Msk          0x8000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS16_Pos          16UL
#define SMIF_MPC_BLK_LUT_ATTR_NS16_Msk          0x10000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS17_Pos          17UL
#define SMIF_MPC_BLK_LUT_ATTR_NS17_Msk          0x20000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS18_Pos          18UL
#define SMIF_MPC_BLK_LUT_ATTR_NS18_Msk          0x40000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS19_Pos          19UL
#define SMIF_MPC_BLK_LUT_ATTR_NS19_Msk          0x80000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS20_Pos          20UL
#define SMIF_MPC_BLK_LUT_ATTR_NS20_Msk          0x100000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS21_Pos          21UL
#define SMIF_MPC_BLK_LUT_ATTR_NS21_Msk          0x200000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS22_Pos          22UL
#define SMIF_MPC_BLK_LUT_ATTR_NS22_Msk          0x400000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS23_Pos          23UL
#define SMIF_MPC_BLK_LUT_ATTR_NS23_Msk          0x800000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS24_Pos          24UL
#define SMIF_MPC_BLK_LUT_ATTR_NS24_Msk          0x1000000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS25_Pos          25UL
#define SMIF_MPC_BLK_LUT_ATTR_NS25_Msk          0x2000000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS26_Pos          26UL
#define SMIF_MPC_BLK_LUT_ATTR_NS26_Msk          0x4000000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS27_Pos          27UL
#define SMIF_MPC_BLK_LUT_ATTR_NS27_Msk          0x8000000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS28_Pos          28UL
#define SMIF_MPC_BLK_LUT_ATTR_NS28_Msk          0x10000000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS29_Pos          29UL
#define SMIF_MPC_BLK_LUT_ATTR_NS29_Msk          0x20000000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS30_Pos          30UL
#define SMIF_MPC_BLK_LUT_ATTR_NS30_Msk          0x40000000UL
#define SMIF_MPC_BLK_LUT_ATTR_NS31_Pos          31UL
#define SMIF_MPC_BLK_LUT_ATTR_NS31_Msk          0x80000000UL
/* SMIF_MPC.ROT_CTRL */
#define SMIF_MPC_ROT_CTRL_AUTO_INC_Pos          8UL
#define SMIF_MPC_ROT_CTRL_AUTO_INC_Msk          0x100UL
#define SMIF_MPC_ROT_CTRL_LOCK_Pos              31UL
#define SMIF_MPC_ROT_CTRL_LOCK_Msk              0x80000000UL
/* SMIF_MPC.ROT_CFG */
#define SMIF_MPC_ROT_CFG_BLOCK_SIZE_Pos         0UL
#define SMIF_MPC_ROT_CFG_BLOCK_SIZE_Msk         0xFUL
/* SMIF_MPC.ROT_BLK_MAX */
#define SMIF_MPC_ROT_BLK_MAX_VALUE_Pos          0UL
#define SMIF_MPC_ROT_BLK_MAX_VALUE_Msk          0xFFFFFFFFUL
/* SMIF_MPC.ROT_BLK_CFG */
#define SMIF_MPC_ROT_BLK_CFG_BLOCK_SIZE_Pos     0UL
#define SMIF_MPC_ROT_BLK_CFG_BLOCK_SIZE_Msk     0xFUL
#define SMIF_MPC_ROT_BLK_CFG_INIT_IN_PROGRESS_Pos 31UL
#define SMIF_MPC_ROT_BLK_CFG_INIT_IN_PROGRESS_Msk 0x80000000UL
/* SMIF_MPC.ROT_BLK_IDX */
#define SMIF_MPC_ROT_BLK_IDX_VALUE_Pos          0UL
#define SMIF_MPC_ROT_BLK_IDX_VALUE_Msk          0xFFFFFFFFUL
/* SMIF_MPC.ROT_BLK_PC */
#define SMIF_MPC_ROT_BLK_PC_PC_Pos              0UL
#define SMIF_MPC_ROT_BLK_PC_PC_Msk              0xFUL
/* SMIF_MPC.ROT_BLK_LUT */
#define SMIF_MPC_ROT_BLK_LUT_ATTR0_Pos          0UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR0_Msk          0x7UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR1_Pos          4UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR1_Msk          0x70UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR2_Pos          8UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR2_Msk          0x700UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR3_Pos          12UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR3_Msk          0x7000UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR4_Pos          16UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR4_Msk          0x70000UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR5_Pos          20UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR5_Msk          0x700000UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR6_Pos          24UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR6_Msk          0x7000000UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR7_Pos          28UL
#define SMIF_MPC_ROT_BLK_LUT_ATTR7_Msk          0x70000000UL


/* SMIF.CTL */
#define SMIF_CTL_XIP_MODE_Pos                   0UL
#define SMIF_CTL_XIP_MODE_Msk                   0x1UL
#define SMIF_CTL_CLOCK_IF_TX_SEL_Pos            4UL
#define SMIF_CTL_CLOCK_IF_TX_SEL_Msk            0x10UL
#define SMIF_CTL_DELAY_LINE_SEL_Pos             5UL
#define SMIF_CTL_DELAY_LINE_SEL_Msk             0xE0UL
#define SMIF_CTL_DELAY_TAP_ENABLED_Pos          8UL
#define SMIF_CTL_DELAY_TAP_ENABLED_Msk          0x100UL
#define SMIF_CTL_INT_CLOCK_DL_ENABLED_Pos       9UL
#define SMIF_CTL_INT_CLOCK_DL_ENABLED_Msk       0x200UL
#define SMIF_CTL_INT_CLOCK_CAPTURE_CYCLE_Pos    10UL
#define SMIF_CTL_INT_CLOCK_CAPTURE_CYCLE_Msk    0xC00UL
#define SMIF_CTL_CLOCK_IF_RX_SEL_Pos            12UL
#define SMIF_CTL_CLOCK_IF_RX_SEL_Msk            0x7000UL
#define SMIF_CTL_DESELECT_DELAY_Pos             16UL
#define SMIF_CTL_DESELECT_DELAY_Msk             0x70000UL
#define SMIF_CTL_SELECT_SETUP_DELAY_Pos         20UL
#define SMIF_CTL_SELECT_SETUP_DELAY_Msk         0x300000UL
#define SMIF_CTL_SELECT_HOLD_DELAY_Pos          22UL
#define SMIF_CTL_SELECT_HOLD_DELAY_Msk          0xC00000UL
#define SMIF_CTL_BLOCK_Pos                      24UL
#define SMIF_CTL_BLOCK_Msk                      0x1000000UL
#define SMIF_CTL_CLOCK_IF_SEL_Pos               25UL
#define SMIF_CTL_CLOCK_IF_SEL_Msk               0x2000000UL
#define SMIF_CTL_ENABLED_Pos                    31UL
#define SMIF_CTL_ENABLED_Msk                    0x80000000UL
/* SMIF.STATUS */
#define SMIF_STATUS_BUSY_Pos                    31UL
#define SMIF_STATUS_BUSY_Msk                    0x80000000UL
/* SMIF.INT_CLOCK_DELAY_TAP_SEL0 */
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0_DATA_BIT0_Pos 0UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0_DATA_BIT0_Msk 0xFFUL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0_DATA_BIT1_Pos 8UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0_DATA_BIT1_Msk 0xFF00UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0_DATA_BIT2_Pos 16UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0_DATA_BIT2_Msk 0xFF0000UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0_DATA_BIT3_Pos 24UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0_DATA_BIT3_Msk 0xFF000000UL
/* SMIF.INT_CLOCK_DELAY_TAP_SEL1 */
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1_DATA_BIT4_Pos 0UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1_DATA_BIT4_Msk 0xFFUL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1_DATA_BIT5_Pos 8UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1_DATA_BIT5_Msk 0xFF00UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1_DATA_BIT6_Pos 16UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1_DATA_BIT6_Msk 0xFF0000UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1_DATA_BIT7_Pos 24UL
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1_DATA_BIT7_Msk 0xFF000000UL
/* SMIF.DL_CTL */
#define SMIF_DL_CTL_DLP_Pos                     0UL
#define SMIF_DL_CTL_DLP_Msk                     0xFFFFUL
#define SMIF_DL_CTL_DLP_SIZE_Pos                16UL
#define SMIF_DL_CTL_DLP_SIZE_Msk                0xF0000UL
#define SMIF_DL_CTL_DL_WARNING_LEVEL_Pos        24UL
#define SMIF_DL_CTL_DL_WARNING_LEVEL_Msk        0xF000000UL
/* SMIF.DL_STATUS0 */
#define SMIF_DL_STATUS0_DATA_BIT0_Pos           0UL
#define SMIF_DL_STATUS0_DATA_BIT0_Msk           0xFFUL
#define SMIF_DL_STATUS0_DATA_BIT1_Pos           8UL
#define SMIF_DL_STATUS0_DATA_BIT1_Msk           0xFF00UL
#define SMIF_DL_STATUS0_DATA_BIT2_Pos           16UL
#define SMIF_DL_STATUS0_DATA_BIT2_Msk           0xFF0000UL
#define SMIF_DL_STATUS0_DATA_BIT3_Pos           24UL
#define SMIF_DL_STATUS0_DATA_BIT3_Msk           0xFF000000UL
/* SMIF.DL_STATUS1 */
#define SMIF_DL_STATUS1_DATA_BIT4_Pos           0UL
#define SMIF_DL_STATUS1_DATA_BIT4_Msk           0xFFUL
#define SMIF_DL_STATUS1_DATA_BIT5_Pos           8UL
#define SMIF_DL_STATUS1_DATA_BIT5_Msk           0xFF00UL
#define SMIF_DL_STATUS1_DATA_BIT6_Pos           16UL
#define SMIF_DL_STATUS1_DATA_BIT6_Msk           0xFF0000UL
#define SMIF_DL_STATUS1_DATA_BIT7_Pos           24UL
#define SMIF_DL_STATUS1_DATA_BIT7_Msk           0xFF000000UL
/* SMIF.TX_CMD_FIFO_STATUS */
#define SMIF_TX_CMD_FIFO_STATUS_USED4_Pos       0UL
#define SMIF_TX_CMD_FIFO_STATUS_USED4_Msk       0xFUL
/* SMIF.TX_CMD_MMIO_FIFO_STATUS */
#define SMIF_TX_CMD_MMIO_FIFO_STATUS_USED4_Pos  0UL
#define SMIF_TX_CMD_MMIO_FIFO_STATUS_USED4_Msk  0xFUL
/* SMIF.TX_CMD_MMIO_FIFO_WR */
#define SMIF_TX_CMD_MMIO_FIFO_WR_DATA27_Pos     0UL
#define SMIF_TX_CMD_MMIO_FIFO_WR_DATA27_Msk     0x7FFFFFFUL
/* SMIF.TX_DATA_MMIO_FIFO_CTL */
#define SMIF_TX_DATA_MMIO_FIFO_CTL_TX_TRIGGER_LEVEL_Pos 0UL
#define SMIF_TX_DATA_MMIO_FIFO_CTL_TX_TRIGGER_LEVEL_Msk 0x7UL
/* SMIF.TX_DATA_FIFO_STATUS */
#define SMIF_TX_DATA_FIFO_STATUS_USED4_Pos      0UL
#define SMIF_TX_DATA_FIFO_STATUS_USED4_Msk      0xFUL
/* SMIF.TX_DATA_MMIO_FIFO_STATUS */
#define SMIF_TX_DATA_MMIO_FIFO_STATUS_USED4_Pos 0UL
#define SMIF_TX_DATA_MMIO_FIFO_STATUS_USED4_Msk 0xFUL
/* SMIF.TX_DATA_MMIO_FIFO_WR1 */
#define SMIF_TX_DATA_MMIO_FIFO_WR1_DATA0_Pos    0UL
#define SMIF_TX_DATA_MMIO_FIFO_WR1_DATA0_Msk    0xFFUL
/* SMIF.TX_DATA_MMIO_FIFO_WR2 */
#define SMIF_TX_DATA_MMIO_FIFO_WR2_DATA0_Pos    0UL
#define SMIF_TX_DATA_MMIO_FIFO_WR2_DATA0_Msk    0xFFUL
#define SMIF_TX_DATA_MMIO_FIFO_WR2_DATA1_Pos    8UL
#define SMIF_TX_DATA_MMIO_FIFO_WR2_DATA1_Msk    0xFF00UL
/* SMIF.TX_DATA_MMIO_FIFO_WR4 */
#define SMIF_TX_DATA_MMIO_FIFO_WR4_DATA0_Pos    0UL
#define SMIF_TX_DATA_MMIO_FIFO_WR4_DATA0_Msk    0xFFUL
#define SMIF_TX_DATA_MMIO_FIFO_WR4_DATA1_Pos    8UL
#define SMIF_TX_DATA_MMIO_FIFO_WR4_DATA1_Msk    0xFF00UL
#define SMIF_TX_DATA_MMIO_FIFO_WR4_DATA2_Pos    16UL
#define SMIF_TX_DATA_MMIO_FIFO_WR4_DATA2_Msk    0xFF0000UL
#define SMIF_TX_DATA_MMIO_FIFO_WR4_DATA3_Pos    24UL
#define SMIF_TX_DATA_MMIO_FIFO_WR4_DATA3_Msk    0xFF000000UL
/* SMIF.TX_DATA_MMIO_FIFO_WR1ODD */
#define SMIF_TX_DATA_MMIO_FIFO_WR1ODD_DATA0_Pos 0UL
#define SMIF_TX_DATA_MMIO_FIFO_WR1ODD_DATA0_Msk 0xFFUL
/* SMIF.RX_DATA_MMIO_FIFO_CTL */
#define SMIF_RX_DATA_MMIO_FIFO_CTL_RX_TRIGGER_LEVEL_Pos 0UL
#define SMIF_RX_DATA_MMIO_FIFO_CTL_RX_TRIGGER_LEVEL_Msk 0x7UL
/* SMIF.RX_DATA_MMIO_FIFO_STATUS */
#define SMIF_RX_DATA_MMIO_FIFO_STATUS_USED4_Pos 0UL
#define SMIF_RX_DATA_MMIO_FIFO_STATUS_USED4_Msk 0xFUL
/* SMIF.RX_DATA_FIFO_STATUS */
#define SMIF_RX_DATA_FIFO_STATUS_USED4_Pos      0UL
#define SMIF_RX_DATA_FIFO_STATUS_USED4_Msk      0xFUL
#define SMIF_RX_DATA_FIFO_STATUS_RX_SR_USED_Pos 8UL
#define SMIF_RX_DATA_FIFO_STATUS_RX_SR_USED_Msk 0x100UL
/* SMIF.RX_DATA_MMIO_FIFO_RD1 */
#define SMIF_RX_DATA_MMIO_FIFO_RD1_DATA0_Pos    0UL
#define SMIF_RX_DATA_MMIO_FIFO_RD1_DATA0_Msk    0xFFUL
/* SMIF.RX_DATA_MMIO_FIFO_RD2 */
#define SMIF_RX_DATA_MMIO_FIFO_RD2_DATA0_Pos    0UL
#define SMIF_RX_DATA_MMIO_FIFO_RD2_DATA0_Msk    0xFFUL
#define SMIF_RX_DATA_MMIO_FIFO_RD2_DATA1_Pos    8UL
#define SMIF_RX_DATA_MMIO_FIFO_RD2_DATA1_Msk    0xFF00UL
/* SMIF.RX_DATA_MMIO_FIFO_RD4 */
#define SMIF_RX_DATA_MMIO_FIFO_RD4_DATA0_Pos    0UL
#define SMIF_RX_DATA_MMIO_FIFO_RD4_DATA0_Msk    0xFFUL
#define SMIF_RX_DATA_MMIO_FIFO_RD4_DATA1_Pos    8UL
#define SMIF_RX_DATA_MMIO_FIFO_RD4_DATA1_Msk    0xFF00UL
#define SMIF_RX_DATA_MMIO_FIFO_RD4_DATA2_Pos    16UL
#define SMIF_RX_DATA_MMIO_FIFO_RD4_DATA2_Msk    0xFF0000UL
#define SMIF_RX_DATA_MMIO_FIFO_RD4_DATA3_Pos    24UL
#define SMIF_RX_DATA_MMIO_FIFO_RD4_DATA3_Msk    0xFF000000UL
/* SMIF.RX_DATA_MMIO_FIFO_RD1_SILENT */
#define SMIF_RX_DATA_MMIO_FIFO_RD1_SILENT_DATA0_Pos 0UL
#define SMIF_RX_DATA_MMIO_FIFO_RD1_SILENT_DATA0_Msk 0xFFUL
/* SMIF.SLOW_CA_CTL */
#define SMIF_SLOW_CA_CTL_WAY_Pos                16UL
#define SMIF_SLOW_CA_CTL_WAY_Msk                0x30000UL
#define SMIF_SLOW_CA_CTL_SET_ADDR_Pos           24UL
#define SMIF_SLOW_CA_CTL_SET_ADDR_Msk           0x3000000UL
#define SMIF_SLOW_CA_CTL_PREF_EN_Pos            30UL
#define SMIF_SLOW_CA_CTL_PREF_EN_Msk            0x40000000UL
#define SMIF_SLOW_CA_CTL_ENABLED_Pos            31UL
#define SMIF_SLOW_CA_CTL_ENABLED_Msk            0x80000000UL
/* SMIF.SLOW_CA_CMD */
#define SMIF_SLOW_CA_CMD_INV_Pos                0UL
#define SMIF_SLOW_CA_CMD_INV_Msk                0x1UL
/* SMIF.FAST_CA_CTL */
#define SMIF_FAST_CA_CTL_WAY_Pos                16UL
#define SMIF_FAST_CA_CTL_WAY_Msk                0x30000UL
#define SMIF_FAST_CA_CTL_SET_ADDR_Pos           24UL
#define SMIF_FAST_CA_CTL_SET_ADDR_Msk           0x3000000UL
#define SMIF_FAST_CA_CTL_PREF_EN_Pos            30UL
#define SMIF_FAST_CA_CTL_PREF_EN_Msk            0x40000000UL
#define SMIF_FAST_CA_CTL_ENABLED_Pos            31UL
#define SMIF_FAST_CA_CTL_ENABLED_Msk            0x80000000UL
/* SMIF.FAST_CA_CMD */
#define SMIF_FAST_CA_CMD_INV_Pos                0UL
#define SMIF_FAST_CA_CMD_INV_Msk                0x1UL
/* SMIF.CRC_CMD */
#define SMIF_CRC_CMD_START_Pos                  0UL
#define SMIF_CRC_CMD_START_Msk                  0x1UL
#define SMIF_CRC_CMD_CONTINUE_Pos               1UL
#define SMIF_CRC_CMD_CONTINUE_Msk               0x2UL
/* SMIF.CRC_INPUT0 */
#define SMIF_CRC_INPUT0_INPUT_Pos               0UL
#define SMIF_CRC_INPUT0_INPUT_Msk               0xFFFFFFFFUL
/* SMIF.CRC_INPUT1 */
#define SMIF_CRC_INPUT1_INPUT_Pos               0UL
#define SMIF_CRC_INPUT1_INPUT_Msk               0xFFFFFFFFUL
/* SMIF.CRC_OUTPUT */
#define SMIF_CRC_OUTPUT_CRC_OUTPUT_Pos          0UL
#define SMIF_CRC_OUTPUT_CRC_OUTPUT_Msk          0xFFUL
/* SMIF.INTR */
#define SMIF_INTR_TR_TX_REQ_Pos                 0UL
#define SMIF_INTR_TR_TX_REQ_Msk                 0x1UL
#define SMIF_INTR_TR_RX_REQ_Pos                 1UL
#define SMIF_INTR_TR_RX_REQ_Msk                 0x2UL
#define SMIF_INTR_XIP_ALIGNMENT_ERROR_Pos       2UL
#define SMIF_INTR_XIP_ALIGNMENT_ERROR_Msk       0x4UL
#define SMIF_INTR_TX_CMD_FIFO_OVERFLOW_Pos      3UL
#define SMIF_INTR_TX_CMD_FIFO_OVERFLOW_Msk      0x8UL
#define SMIF_INTR_TX_DATA_FIFO_OVERFLOW_Pos     4UL
#define SMIF_INTR_TX_DATA_FIFO_OVERFLOW_Msk     0x10UL
#define SMIF_INTR_RX_DATA_MMIO_FIFO_UNDERFLOW_Pos 5UL
#define SMIF_INTR_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk 0x20UL
#define SMIF_INTR_DL_FAIL_Pos                   8UL
#define SMIF_INTR_DL_FAIL_Msk                   0x100UL
#define SMIF_INTR_DL_WARNING_Pos                12UL
#define SMIF_INTR_DL_WARNING_Msk                0x1000UL
#define SMIF_INTR_CRC_ERROR_Pos                 16UL
#define SMIF_INTR_CRC_ERROR_Msk                 0x10000UL
#define SMIF_INTR_FS_STATUS_ERROR_Pos           17UL
#define SMIF_INTR_FS_STATUS_ERROR_Msk           0x20000UL
/* SMIF.INTR_SET */
#define SMIF_INTR_SET_TR_TX_REQ_Pos             0UL
#define SMIF_INTR_SET_TR_TX_REQ_Msk             0x1UL
#define SMIF_INTR_SET_TR_RX_REQ_Pos             1UL
#define SMIF_INTR_SET_TR_RX_REQ_Msk             0x2UL
#define SMIF_INTR_SET_XIP_ALIGNMENT_ERROR_Pos   2UL
#define SMIF_INTR_SET_XIP_ALIGNMENT_ERROR_Msk   0x4UL
#define SMIF_INTR_SET_TX_CMD_FIFO_OVERFLOW_Pos  3UL
#define SMIF_INTR_SET_TX_CMD_FIFO_OVERFLOW_Msk  0x8UL
#define SMIF_INTR_SET_TX_DATA_FIFO_OVERFLOW_Pos 4UL
#define SMIF_INTR_SET_TX_DATA_FIFO_OVERFLOW_Msk 0x10UL
#define SMIF_INTR_SET_RX_DATA_MMIO_FIFO_UNDERFLOW_Pos 5UL
#define SMIF_INTR_SET_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk 0x20UL
#define SMIF_INTR_SET_DL_FAIL_Pos               8UL
#define SMIF_INTR_SET_DL_FAIL_Msk               0x100UL
#define SMIF_INTR_SET_DL_WARNING_Pos            12UL
#define SMIF_INTR_SET_DL_WARNING_Msk            0x1000UL
#define SMIF_INTR_SET_CRC_ERROR_Pos             16UL
#define SMIF_INTR_SET_CRC_ERROR_Msk             0x10000UL
#define SMIF_INTR_SET_FS_STATUS_ERROR_Pos       17UL
#define SMIF_INTR_SET_FS_STATUS_ERROR_Msk       0x20000UL
/* SMIF.INTR_MASK */
#define SMIF_INTR_MASK_TR_TX_REQ_Pos            0UL
#define SMIF_INTR_MASK_TR_TX_REQ_Msk            0x1UL
#define SMIF_INTR_MASK_TR_RX_REQ_Pos            1UL
#define SMIF_INTR_MASK_TR_RX_REQ_Msk            0x2UL
#define SMIF_INTR_MASK_XIP_ALIGNMENT_ERROR_Pos  2UL
#define SMIF_INTR_MASK_XIP_ALIGNMENT_ERROR_Msk  0x4UL
#define SMIF_INTR_MASK_TX_CMD_FIFO_OVERFLOW_Pos 3UL
#define SMIF_INTR_MASK_TX_CMD_FIFO_OVERFLOW_Msk 0x8UL
#define SMIF_INTR_MASK_TX_DATA_FIFO_OVERFLOW_Pos 4UL
#define SMIF_INTR_MASK_TX_DATA_FIFO_OVERFLOW_Msk 0x10UL
#define SMIF_INTR_MASK_RX_DATA_MMIO_FIFO_UNDERFLOW_Pos 5UL
#define SMIF_INTR_MASK_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk 0x20UL
#define SMIF_INTR_MASK_DL_FAIL_Pos              8UL
#define SMIF_INTR_MASK_DL_FAIL_Msk              0x100UL
#define SMIF_INTR_MASK_DL_WARNING_Pos           12UL
#define SMIF_INTR_MASK_DL_WARNING_Msk           0x1000UL
#define SMIF_INTR_MASK_CRC_ERROR_Pos            16UL
#define SMIF_INTR_MASK_CRC_ERROR_Msk            0x10000UL
#define SMIF_INTR_MASK_FS_STATUS_ERROR_Pos      17UL
#define SMIF_INTR_MASK_FS_STATUS_ERROR_Msk      0x20000UL
/* SMIF.INTR_MASKED */
#define SMIF_INTR_MASKED_TR_TX_REQ_Pos          0UL
#define SMIF_INTR_MASKED_TR_TX_REQ_Msk          0x1UL
#define SMIF_INTR_MASKED_TR_RX_REQ_Pos          1UL
#define SMIF_INTR_MASKED_TR_RX_REQ_Msk          0x2UL
#define SMIF_INTR_MASKED_XIP_ALIGNMENT_ERROR_Pos 2UL
#define SMIF_INTR_MASKED_XIP_ALIGNMENT_ERROR_Msk 0x4UL
#define SMIF_INTR_MASKED_TX_CMD_FIFO_OVERFLOW_Pos 3UL
#define SMIF_INTR_MASKED_TX_CMD_FIFO_OVERFLOW_Msk 0x8UL
#define SMIF_INTR_MASKED_TX_DATA_FIFO_OVERFLOW_Pos 4UL
#define SMIF_INTR_MASKED_TX_DATA_FIFO_OVERFLOW_Msk 0x10UL
#define SMIF_INTR_MASKED_RX_DATA_MMIO_FIFO_UNDERFLOW_Pos 5UL
#define SMIF_INTR_MASKED_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk 0x20UL
#define SMIF_INTR_MASKED_DL_FAIL_Pos            8UL
#define SMIF_INTR_MASKED_DL_FAIL_Msk            0x100UL
#define SMIF_INTR_MASKED_DL_WARNING_Pos         12UL
#define SMIF_INTR_MASKED_DL_WARNING_Msk         0x1000UL
#define SMIF_INTR_MASKED_CRC_ERROR_Pos          16UL
#define SMIF_INTR_MASKED_CRC_ERROR_Msk          0x10000UL
#define SMIF_INTR_MASKED_FS_STATUS_ERROR_Pos    17UL
#define SMIF_INTR_MASKED_FS_STATUS_ERROR_Msk    0x20000UL
/* SMIF.INTR_CAUSE */
#define SMIF_INTR_CAUSE_NORMAL_Pos              0UL
#define SMIF_INTR_CAUSE_NORMAL_Msk              0x1UL
#define SMIF_INTR_CAUSE_MPC_Pos                 1UL
#define SMIF_INTR_CAUSE_MPC_Msk                 0x2UL


#endif /* _CYIP_SMIF_V3_H_ */


/* [] END OF FILE */
